### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # random_pet.this will be destroyed
-   resource "random_pet" "this" {
-       id        = "moving-panther" -> null
-       length    = 2 -> null
-       separator = "-" -> null
    }

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "lambda" {
!       arn               = "arn:aws:logs:us-east-1:350131064538:log-group:/aws/lambda/cataprato-core-lambda" -> (known after apply)
!       id                = "/aws/lambda/cataprato-core-lambda" -> (known after apply)
!       name              = "/aws/lambda/cataprato-core-lambda" -> "/aws/lambda/cataprato-auth-lambda"
+       name_prefix       = (known after apply)
-       tags              = {} -> null
!       tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy.logs[0] must be replaced
-/+ resource "aws_iam_policy" "logs" {
!       arn         = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-core-lambda-logs" -> (known after apply)
!       id          = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-core-lambda-logs" -> (known after apply)
!       name        = "cataprato-core-lambda-logs" -> "cataprato-auth-lambda-logs"
+       name_prefix = (known after apply)
!       policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-east-1:350131064538:log-group:/aws/lambda/cataprato-core-lambda:*:*",
-                           "arn:aws:logs:us-east-1:350131064538:log-group:/aws/lambda/cataprato-core-lambda:*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
!       policy_id   = "ANPAVDBLQB3NBMNFKHPYN" -> (known after apply)
-       tags        = {} -> null
!       tags_all    = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.lambda_function.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "cataprato-auth-lambda"
+       name_prefix           = (known after apply)
+       path                  = "/tf-managed/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "cataprato-auth-lambda"
    }

  # module.lambda_function.aws_lambda_function.this[0] must be replaced
-/+ resource "aws_lambda_function" "this" {
!       arn                            = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda" -> (known after apply)
!       description                    = "Cataprato core" -> "Cataprato auth"
!       function_name                  = "cataprato-core-lambda" -> "cataprato-auth-lambda"
!       handler                        = "lambda.handler" -> "main.handler"
!       id                             = "cataprato-core-lambda" -> (known after apply)
!       invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda/invocations" -> (known after apply)
!       last_modified                  = "2023-08-05T04:29:33.323+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:1",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:1" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:1/invocations" -> (known after apply)
!       role                           = "arn:aws:iam::350131064538:role/tf-managed/cataprato-core-lambda" -> (known after apply)
!       runtime                        = "nodejs18.x" -> "python3.10"
!       s3_bucket                      = "moving-panther-20230805042917207000000001" -> (known after apply)
!       s3_key                         = "lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip" -> "lambda-builds/2d65d7d70439df5a918192fa9340ee9aca109131559ace71b5d83bb0738e1edb.zip"
+       s3_object_version              = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
!       source_code_hash               = "dL7/YFIdmGOAURvO54iCbiO8slM78N4Aq7JEV2Jau3Y=" -> (known after apply)
!       source_code_size               = 480 -> (known after apply)
-       tags                           = {} -> null
!       tags_all                       = {} -> (known after apply)
!       version                        = "1" -> (known after apply)
        # (7 unchanged attributes hidden)

-       tracing_config {
-           mode = "PassThrough" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_function_url.this[0] must be replaced
-/+ resource "aws_lambda_function_url" "this" {
!       function_arn       = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda" -> (known after apply)
!       function_name      = "cataprato-core-lambda" -> "cataprato-auth-lambda"
!       function_url       = "https://sj7gxiu5qstxv3rr4rpuqycbum0umfqb.lambda-url.us-east-1.on.aws/" -> (known after apply)
!       id                 = "cataprato-core-lambda" -> (known after apply)
!       url_id             = "sj7gxiu5qstxv3rr4rpuqycbum0umfqb" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       function_name       = "cataprato-core-lambda" -> "cataprato-auth-lambda"
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "1" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
!       function_name       = "cataprato-core-lambda" -> "cataprato-auth-lambda"
!       id                  = "APIGatewayAny" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "lambda-builds/2d65d7d70439df5a918192fa9340ee9aca109131559ace71b5d83bb0738e1edb.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "./.terraform/lambda-builds/2d65d7d70439df5a918192fa9340ee9aca109131559ace71b5d83bb0738e1edb.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./main.py",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/2d65d7d70439df5a918192fa9340ee9aca109131559ace71b5d83bb0738e1edb.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/2d65d7d70439df5a918192fa9340ee9aca109131559ace71b5d83bb0738e1edb.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7998777001289125626" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip" -> "./.terraform/lambda-builds/2d65d7d70439df5a918192fa9340ee9aca109131559ace71b5d83bb0738e1edb.zip"
!           "timestamp" = "1691209722176080000" -> "1691356001095268000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "432331808987591256" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/9a929d520504c903f8ecc842a203c534bbf1301e3557bfd25d30a452cc5de3a8.zip" -> "./.terraform/lambda-builds/2d65d7d70439df5a918192fa9340ee9aca109131559ace71b5d83bb0738e1edb.zip"
!           "original_source_code" = "\"./dist/lambda.js\"" -> "\"./main.py\""
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:1" -> (known after apply)
-       compatible_architectures    = [] -> null
!       compatible_runtimes         = [
-           "nodejs18.x",
+           "python3.10",
        ]
!       created_date                = "2023-08-05T04:29:22.004+0000" -> (known after apply)
!       description                 = "Node_modules layer" -> "Pip layer"
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:1" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3" -> (known after apply)
!       layer_name                  = "cataprato-core-layer-s3" -> "cataprato-auth-layer-s3"
!       s3_bucket                   = "moving-panther-20230805042917207000000001" -> (known after apply)
!       s3_key                      = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip" -> "builds/0e5271bd357d15463f84f5909263453a87560af9f1ba51242c8f6e6a742fc740.zip"
+       s3_object_version           = (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "n7pqs4t9Os5MW3VMir5BSjMzhs7uDw0qTrLD6vXUA5A=" -> (known after apply)
!       source_code_size            = 27196 -> (known after apply)
!       version                     = "1" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/0e5271bd357d15463f84f5909263453a87560af9f1ba51242c8f6e6a742fc740.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "builds/0e5271bd357d15463f84f5909263453a87560af9f1ba51242c8f6e6a742fc740.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist",
+                       null,
                    ],
                ]
+               filename      = "builds/0e5271bd357d15463f84f5909263453a87560af9f1ba51242c8f6e6a742fc740.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/0e5271bd357d15463f84f5909263453a87560af9f1ba51242c8f6e6a742fc740.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "3614466643197314784" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip" -> "builds/0e5271bd357d15463f84f5909263453a87560af9f1ba51242c8f6e6a742fc740.zip"
!           "timestamp" = "1691209722193508000" -> "1691356002588663200"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "5256359067315492219" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/f9eb37338121f3b4c44c704293a2bed88de27d2cb53fcdfd0132d76ad8f7fa0f.zip" -> "builds/0e5271bd357d15463f84f5909263453a87560af9f1ba51242c8f6e6a742fc740.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = "cataprato-auth-"
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = false
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created
+   resource "aws_s3_bucket_versioning" "this" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

Plan: 20 to add, 0 to change, 12 to destroy.
```
</details>